Revit 2026 API

# BuiltInFailuresDirectContext3DFailures Class

---

SystemObject Autodesk.Revit.DBBuiltInFailuresDirectContext3DFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class DirectContext3DFailures
```
```vb
Public NotInheritable Class DirectContext3DFailures
```
```cpp
public ref class DirectContext3DFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type DirectContext3DFailures = class end
```

The BuiltInFailuresDirectContext3DFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | NoMoreExternalDataTypeInstances | No more instances of the Coordination Model. |
|  | UnableToLoadCoordinationModel | Unable to load Coordination Model. |

#### Reference

Autodesk.Revit.DB Namespace